package com.linker.direct.main.member.DAO;

import java.util.List;

import org.springframework.dao.DataAccessException;

import com.linker.direct.main.member.VO.MemberVO;

//------------------------------------------------------------------------------------------------
// 회원정보 DAO
//------------------------------------------------------------------------------------------------
public interface MemberDAO {

	//------------------------------------------------------------------------------------------------
	// 로그인 처리
	//------------------------------------------------------------------------------------------------
	public MemberVO loginByID(MemberVO memberVO) throws DataAccessException;
	
	
	//------------------------------------------------------------------------------------------------
	// 회원가입 처리
	//------------------------------------------------------------------------------------------------
	public int addMember(MemberVO memberVO) throws DataAccessException;
	
	//------------------------------------------------------------------------------------------------
	// 회원 전체 목록 가져오기
	//------------------------------------------------------------------------------------------------
	public List<MemberVO> selectAllMemberList() throws DataAccessException;
	
	//------------------------------------------------------------------------------------------------
	// 아이디에 해당하는 회원 정보 수정
	//------------------------------------------------------------------------------------------------
	public int updateMember(MemberVO memberVO) throws DataAccessException;
	
	//------------------------------------------------------------------------------------------------
	// 아이디에 해당하는 회원 정보 삭제
	//------------------------------------------------------------------------------------------------
	public int removeMember(String id) throws DataAccessException;
	
	//------------------------------------------------------------------------------------------------
	// 아이디 중복 검사 (AJAX)
	//------------------------------------------------------------------------------------------------
	public int idCheck(MemberVO memberVO) throws DataAccessException;
	
	
} // End - public interface MemberDAO

